theHerick/soundvision/firmware/esp32c3_ultrasonic/esp32c3_ultrasonic.ino
/*
 * =====================================================================================
 *  PROJETO SOUNDVISION - TECNOLOGIA ASSISTIVA & PLATAFORMA PEDAGÓGICA (CBA 2026)
 * =====================================================================================
 *  Título: Aprendizagem Baseada em Projetos no Ensino de Engenharia por Meio do
 *          Desenvolvimento de um Dispositivo Vestível Assistivo Ultrassônico
 *  Autores: Herick Betin Tiburski, Michael Douglas Cabral Alves, 
 *           Jordan Passinato Sausen, Maurício de Campos (UNIVALI)
 * 
 *  Repositório Oficial: https://github.com/theHerick/soundvision
 * 
 *  Descrição Técnica:
 *  - Microcontrolador: ESP32-C3 Mini (Arquitetura RISC-V 32-bit @ 80-160 MHz)
 *  - Arranjo Tridirecional de Sensores: 3x HC-SR04 (Esquerda, Frente, Direita)
 *  - FREQUÊNCIAS SUAVES E MACIAS: Oitava grave-média (440Hz, 523Hz, 659Hz) sem estridente
 *  - CONTROLE DE DISTÂNCIA MÁXIMA (d_max) INDIVIDUAL por sensor (Mínima fixa em 0 cm)
 *  - MODULAÇÃO DOS BIPS: Intervalo de pulso sonoro T_pulso = Distância (cm) * 10 ms
 *  - BIPS CURTOS DE 40MS: Som sutil, macio e agradável de ouvir
 *  - BOTÕES GRANDES DE ACESSIBILIDADE: Painel com opção "Voz ao Clicar"
 *  - BLOQUEIO DE ZOOM: Zoom de tela totalmente desativado (user-scalable=no)
 *  - VISOR DO ESTUDANTE: Telemetria e Radar espacial em tempo real
 *  - Topo Limpo: Apenas o título "SoundVision" no cabeçalho
 *  - Arquitetura de Software: Máquina de Estados Finitos (FSM) não bloqueante
 *  - Latência Determinística de Ciclo: ~56 ms (Frequência de amostragem ~17.8 Hz)
 *  - Conectividade IoT: AP Mode + Servidor HTTP + WebSocket Nativo (Zero Bibliotecas)
 * =====================================================================================
 */

#include <WiFi.h>
#include <WebServer.h>

// Para verificação de versão do ESP32 Arduino Core (v2 vs v3)
#include <esp_arduino_version.h>

// =====================================================================================
// 1. DEFINIÇÕES DE PINOS DE HARDWARE (PINAGEM PERSONALIZADA DO USUÁRIO)
// =====================================================================================
// Sensores Ultrassônicos HC-SR04
#define PIN_TRIG_LEFT    2   // GPIO Trigger - Sensor Esquerdo
#define PIN_ECHO_LEFT    1   // GPIO Echo    - Sensor Esquerdo

#define PIN_TRIG_FRONT   4   // GPIO Trigger - Sensor Frontal
#define PIN_ECHO_FRONT   3   // GPIO Echo    - Sensor Frontal

#define PIN_TRIG_RIGHT   5   // GPIO Trigger - Sensor Direito
#define PIN_ECHO_RIGHT   6   // GPIO Echo    - Sensor Direito

// Buzzers Piezoelétricos (Atuação Auditiva Direcional por Timbre/Frequência)
#define PIN_BUZZER_LEFT  7   // Buzzer Flanco Esquerdo (Tom Lá4 - 440 Hz - Quente e Suave)
#define PIN_BUZZER_FRONT 0   // Buzzer Centro Frontal   (Tom Dó5 - 523 Hz - Tom Médio)
#define PIN_BUZZER_RIGHT 8   // Buzzer Flanco Direito  (Tom Mi5 - 659 Hz - Macio e Suave)

// Frequências tonais aveludadas, graves e macias (Acorde Lá-Dó-Mi sem agudos estridentes)
#define FREQ_BUZZER_LEFT   440  // Hz (Nota Lá4 - Tom grave e macio)
#define FREQ_BUZZER_FRONT  523  // Hz (Nota Dó5 - Tom central aconchegante)
#define FREQ_BUZZER_RIGHT  659  // Hz (Nota Mi5 - Tom médio suave)

// Canais PWM LEDC para controle de áudio no ESP32-C3
#define LEDC_CHAN_LEFT   0
#define LEDC_CHAN_FRONT  1
#define LEDC_CHAN_RIGHT  2
#define LEDC_RESOLUTION  8   // Resolução de 8 bits (0-255)

// =====================================================================================
// 2. PARÂMETROS FÍSICOS E EQUAÇÕES DO SISTEMA
// =====================================================================================
// Velocidade do som no ar a 20°C: v_som = 343 m/s = 0.0343 cm/us
const float VELOCIDADE_SOM_CM_US = 0.0343f;

// Duração de cada pulso sonoro (bip curto, sutil e agradável de 40ms)
const unsigned long BEEP_DURATION_MS = 40;

// Tempo de multiplexação acústica entre disparos dos sensores (evita crosstalk)
const unsigned long DELAY_MULTIPLEX_MS = 20; 

// Estado dos Buzzers Físicos: INICIA DESATIVADO AO LIGAR (Requisito do Usuário)
bool physicalBuzzersEnabled = false;

// Configuração do Ponto de Acesso Wi-Fi (AP Mode)
const char* AP_SSID = "SoundVision-AP";
const char* AP_PASS = "soundvision123";

// Servidores de Rede Nativo
WebServer server(80);
WiFiServer wsServer(81); // Servidor WebSocket Nativo na porta 81

// Gerenciamento de Clientes WebSocket
const int MAX_WS_CLIENTS = 4;
struct WSClient {
  WiFiClient client;
  bool handshaken;
};
WSClient wsClients[MAX_WS_CLIENTS];

// =====================================================================================
// 3. ESTRUTURAS DE DADOS E MÁQUINA DE ESTADOS FINITOS (FSM)
// =====================================================================================
enum FsmState {
  STATE_INIT_WEB,      // Inicialização da Rede e Ponto de Acesso IoT
  STATE_INIT_SENSORS,  // Configuração e Calibração dos Pinos I/O
  STATE_READ_SENSORS,  // Aquisição das Distâncias dos 3 Sensores
  STATE_PROCESS_DATA,  // Cálculo de T_pulso (Distância * 10ms)
  STATE_ACTUATION      // Modulação Temporal dos Buzzers e Envio de Telemetria IoT
};

FsmState currentState = STATE_INIT_WEB;

struct Sensor {
  uint8_t trigPin;
  uint8_t echoPin;
  uint8_t buzzerPin;
  uint8_t ledcChannel;
  uint16_t buzzerFreq;
  float distance;            // Distância calculada em cm
  float pulseInterval;       // T_pulso calculado em ms (distancia * 10)
  float d_min;               // Distância MÍNIMA (Fixa em 0 cm conforme pedido)
  float d_max;               // Distância MÁXIMA de alerta INDIVIDUAL (cm)
  bool enabled;              // Status de ativação individual via IoT
  unsigned long lastBeepTime;// Tempo de início do último bip
  bool buzzerState;          // Estado atual do bip (true = tocando, false = silêncio)
};

Sensor sensors[3] = {
  { PIN_TRIG_LEFT,  PIN_ECHO_LEFT,  PIN_BUZZER_LEFT,  LEDC_CHAN_LEFT,  FREQ_BUZZER_LEFT,  400.0f, 4000.0f, 0.0f, 400.0f, true, 0, false }, // 0: Esquerda
  { PIN_TRIG_FRONT, PIN_ECHO_FRONT, PIN_BUZZER_FRONT, LEDC_CHAN_FRONT, FREQ_BUZZER_FRONT, 400.0f, 4000.0f, 0.0f, 400.0f, true, 0, false }, // 1: Frontal
  { PIN_TRIG_RIGHT, PIN_ECHO_RIGHT, PIN_BUZZER_RIGHT, LEDC_CHAN_RIGHT, FREQ_BUZZER_RIGHT, 400.0f, 4000.0f, 0.0f, 400.0f, true, 0, false }  // 2: Direita
};

// Métricas de Desempenho e Latência
unsigned long cycleStartTime = 0;
unsigned long lastTelemetryTime = 0;
float currentCycleLatencyMs = 56.0f;

// =====================================================================================
// 4. FUNÇÕES ABSTRATAS DE PWM LEDC (COMPATIBILIDADE ESP32 CORE V2.X E V3.X)
// =====================================================================================
void initBuzzer(uint8_t pin, uint8_t channel, uint16_t freq) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(pin, freq, LEDC_RESOLUTION);
  ledcWrite(pin, 0);
#else
  ledcSetup(channel, freq, LEDC_RESOLUTION);
  ledcAttachPin(pin, channel);
  ledcWrite(channel, 0);
#endif
}

void setBuzzerTone(uint8_t pin, uint8_t channel, uint16_t freq) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWriteTone(pin, freq);
#else
  ledcWriteTone(channel, freq);
#endif
}

void silenceBuzzerPin(uint8_t pin, uint8_t channel) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pin, 0);
#else
  ledcWrite(channel, 0);
#endif
}

// =====================================================================================
// 5. IMPLEMENTAÇÃO NATIVA E LEVE DE WEBSOCKET (SHA1 + BASE64 EMBUTIDOS - ZERO BIBLIOTECA)
// =====================================================================================
const char b64_alphabet[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

