theHerick/soundvision/firmware/esp32c3_ultrasonic/esp32c3_ultrasonic.ino
String base64Encode(const uint8_t* data, size_t length) {
  String result = "";
  result.reserve(((length + 2) / 3) * 4);
  for (size_t i = 0; i < length; i += 3) {
    uint32_t val = (data[i] << 16) | ((i + 1 < length ? data[i + 1] : 0) << 8) | (i + 2 < length ? data[i + 2] : 0);
    result += b64_alphabet[(val >> 18) & 0x3F];
    result += b64_alphabet[(val >> 12) & 0x3F];
    result += (i + 1 < length) ? b64_alphabet[(val >> 6) & 0x3F] : '=';
    result += (i + 2 < length) ? b64_alphabet[val & 0x3F] : '=';
  }
  return result;
}

void computeSHA1(const String& input, uint8_t hash[20]) {
  uint32_t h0 = 0x67452301, h1 = 0xEFCDAB89, h2 = 0x98BADCFE, h3 = 0x10325476, h4 = 0xC3D2E1F0;
  uint64_t bitLen = (uint64_t)input.length() * 8;
  size_t newLen = ((input.length() + 8) / 64 + 1) * 64;
  uint8_t* msg = (uint8_t*)calloc(newLen, 1);
  if (!msg) return;
  memcpy(msg, input.c_str(), input.length());
  msg[input.length()] = 0x80;
  for (int i = 0; i < 8; i++) msg[newLen - 1 - i] = (bitLen >> (i * 8)) & 0xFF;

  for (size_t offset = 0; offset < newLen; offset += 64) {
    uint32_t w[80];
    for (int i = 0; i < 16; i++) {
      w[i] = (msg[offset + i * 4] << 24) | (msg[offset + i * 4 + 1] << 16) |
             (msg[offset + i * 4 + 2] << 8) | msg[offset + i * 4 + 3];
    }
    for (int i = 16; i < 80; i++) {
      uint32_t val = w[i - 3] ^ w[i - 8] ^ w[i - 14] ^ w[i - 16];
      w[i] = (val << 1) | (val >> 31);
    }
    uint32_t a = h0, b = h1, c = h2, d = h3, e = h4;
    for (int i = 0; i < 80; i++) {
      uint32_t f, k;
      if (i < 20) { f = (b & c) | ((~b) & d); k = 0x5A827999; }
      else if (i < 40) { f = b ^ c ^ d; k = 0x6ED9EBA1; }
      else if (i < 60) { f = (b & c) | (b & d) | (c & d); k = 0x8F1BBCDC; }
      else { f = b ^ c ^ d; k = 0xCA62C1D6; }
      uint32_t temp = ((a << 5) | (a >> 27)) + f + e + k + w[i];
      e = d; d = c; c = (b << 30) | (b >> 2); b = a; a = temp;
    }
    h0 += a; h1 += b; h2 += c; h3 += d; h4 += e;
  }
  free(msg);
  uint32_t h[5] = {h0, h1, h2, h3, h4};
  for (int i = 0; i < 5; i++) {
    hash[i * 4] = (h[i] >> 24) & 0xFF;
    hash[i * 4 + 1] = (h[i] >> 16) & 0xFF;
    hash[i * 4 + 2] = (h[i] >> 8) & 0xFF;
    hash[i * 4 + 3] = h[i] & 0xFF;
  }
}

String computeAcceptKey(String clientKey) {
  clientKey.trim();
  String magicKey = clientKey + "258EAFA5-E914-47DA-95CA-C5AB0DC85B11";
  uint8_t hash[20];
  computeSHA1(magicKey, hash);
  return base64Encode(hash, 20);
}

void sendWSFrame(WiFiClient &c, const String &msg) {
  if (!c || !c.connected()) return;
  uint8_t header[10];
  size_t msgLen = msg.length();
  size_t headerLen = 0;

  header[0] = 0x81; // FIN = 1, Opcode = 1 (Texto)

  if (msgLen <= 125) {
    header[1] = (uint8_t)msgLen;
    headerLen = 2;
  } else if (msgLen <= 65535) {
    header[1] = 126;
    header[2] = (msgLen >> 8) & 0xFF;
    header[3] = msgLen & 0xFF;
    headerLen = 4;
  }

  c.write(header, headerLen);
  c.print(msg);
}

String readWSFrame(WiFiClient &c) {
  if (!c.available()) return "";
  uint8_t firstByte = c.read();
  if ((firstByte & 0x0F) == 0x08) {
    c.stop();
    return "";
  }
  if (!c.available()) return "";
  uint8_t secondByte = c.read();
  bool masked = (secondByte & 0x80) != 0;
  uint16_t len = secondByte & 0x7F;

  if (len == 126) {
    if (c.available() < 2) return "";
    uint8_t b1 = c.read();
    uint8_t b2 = c.read();
    len = (b1 << 8) | b2;
  }

  uint8_t mask[4] = {0};
  if (masked) {
    for (int i = 0; i < 4; i++) {
      while (!c.available()) delay(1);
      mask[i] = c.read();
    }
  }

  String payload = "";
  payload.reserve(len);
  for (uint16_t i = 0; i < len; i++) {
    while (!c.available()) delay(1);
    uint8_t b = c.read();
    if (masked) b ^= mask[i % 4];
    payload += (char)b;
  }
  return payload;
}

// =====================================================================================
// 6. INTERFACE DE MONITORAMENTO IOT EMBUTIDA (DESIGN CLEAN FLAT - SEM ZOOM)
// =====================================================================================
const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="pt-BR">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
  <title>SoundVision</title>
  <style>
    :root {
      --bg-color: #090d16;
      --card-bg: #162032;
      --card-border: #2d3d59;
      --accent-blue: #2563eb;
      --accent-green: #15803d;
      --accent-red: #b91c1c;
      --text-main: #ffffff;
      --text-sub: #cbd5e1;
    }

    /* Bloqueio de Zoom e Seleção de Texto */
    html, body {
      touch-action: manipulation;
      -webkit-text-size-adjust: 100%;
      user-select: none;
      -webkit-user-select: none;
      overflow-x: hidden;
    }

    * { box-sizing: border-box; margin: 0; padding: 0; font-family: system-ui, -apple-system, sans-serif; }
    body { background-color: var(--bg-color); color: var(--text-main); display: flex; flex-direction: column; align-items: center; min-height: 100vh; padding: 15px; }

    /* Topo Limpo: Apenas o título SoundVision */
    header { text-align: center; width: 100%; max-width: 1100px; padding-bottom: 12px; border-bottom: 2px solid var(--card-border); margin-bottom: 20px; }
    header h1 { font-size: 2.2rem; font-weight: 900; color: #ffffff; letter-spacing: 1px; }

    .main-grid { display: grid; grid-template-columns: 1fr; gap: 20px; width: 100%; max-width: 1100px; }
    @media (min-width: 850px) { .main-grid { grid-template-columns: 1.1fr 0.9fr; } }

    .card { background: var(--card-bg); border: 2px solid var(--card-border); border-radius: 12px; padding: 20px; }
    .card-header-title { font-size: 1.2rem; font-weight: 800; margin-bottom: 15px; border-bottom: 2px solid var(--card-border); padding-bottom: 8px; color: #ffffff; display: flex; align-items: center; justify-content: space-between; }

    /* BOTÕES GRANDES DE ACESSIBILIDADE PARA O USUÁRIO */
    .btn-giant {
      width: 100%;
      min-height: 64px;
      padding: 16px;
      font-size: 1.15rem;
      font-weight: 800;
      border: 3px solid #ffffff;
      border-radius: 12px;
      cursor: pointer;
      margin-bottom: 14px;
      display: flex;
      align-items: center;
      justify-content: center;
      gap: 12px;
      color: #ffffff;
      text-transform: uppercase;
      letter-spacing: 0.5px;
      transition: background 0.15s ease, transform 0.1s ease;
      touch-action: manipulation;
    }
    .btn-giant:active { transform: scale(0.98); }

    .btn-buzzer-off { background: var(--accent-red); }
    .btn-buzzer-on  { background: var(--accent-green); }
    .btn-headphone  { background: var(--accent-blue); }
    .btn-headphone.active { background: var(--accent-green); }
    .btn-voice      { background: #7c3aed; }
    .btn-voice.active { background: var(--accent-green); }

    /* Controles de Máximo Grandes (+ / -) */
    .min-control-box { background: #0f172a; border: 2px solid var(--card-border); border-radius: 8px; padding: 12px; margin-bottom: 12px; }
    .min-control-label { font-size: 1.05rem; font-weight: 800; margin-bottom: 8px; display: flex; justify-content: space-between; color: #ffffff; }
    .btn-group-step { display: flex; align-items: center; gap: 8px; }
    .btn-step { width: 52px; height: 52px; font-size: 1.6rem; font-weight: 900; background: #334155; color: #ffffff; border: 2px solid #64748b; border-radius: 8px; cursor: pointer; display: flex; align-items: center; justify-content: center; touch-action: manipulation; }
    .btn-step:active { background: #475569; }
    .val-display { flex: 1; text-align: center; font-size: 1.5rem; font-weight: 900; color: #ffffff; background: #1e293b; padding: 10px; border-radius: 6px; border: 1px solid var(--card-border); }

    /* VISOR DO ESTUDANTE (RADAR E TELEMETRIA) */
    .canvas-container { position: relative; width: 100%; aspect-ratio: 1; margin-bottom: 15px; }
    canvas { width: 100%; height: 100%; border-radius: 8px; background: #020617; border: 2px solid var(--card-border); }

