theHerick/soundvision/firmware/esp32c3_ultrasonic/esp32c3_ultrasonic.ino
    .student-stats { display: grid; grid-template-columns: repeat(3, 1fr); gap: 10px; }
    .stat-box { background: #0f172a; padding: 12px; border-radius: 8px; text-align: center; border: 2px solid var(--card-border); }
    .stat-box.left { border-top: 5px solid #f43f5e; }
    .stat-box.front { border-top: 5px solid #22c55e; }
    .stat-box.right { border-top: 5px solid #0ea5e9; }
    .stat-label { font-size: 0.75rem; color: var(--text-sub); font-weight: 800; text-transform: uppercase; }
    .stat-val { font-size: 1.5rem; font-weight: 900; margin: 2px 0; color: #ffffff; }

    footer { margin-top: 25px; font-size: 0.8rem; color: var(--text-sub); text-align: center; }
  </style>
</head>
<body>

  <!-- TOPO LIMPO: APENAS O TÍTULO SOUNDVISION -->
  <header>
    <h1>SoundVision</h1>
  </header>

  <div class="main-grid">
    
    <!-- COLUNA 1: PAINEL DO USUÁRIO (BOTÕES GRANDES DE ACESSIBILIDADE) -->
    <div class="card">
      <div class="card-header-title">
        <span>Painel do Usuário</span>
        <span style="font-size: 0.8rem; font-weight: 600; color: var(--text-sub);">Acessibilidade Tátil</span>
      </div>

      <!-- BOTÃO GRANDE 1: LIGAR / DESLIGAR BUZZERS DA PLACA -->
      <button class="btn-giant btn-buzzer-off" id="btnBuzzerGiant" onclick="toggleBuzzerGiant()">
        🔊 BUZZERS DA PLACA: DESATIVADOS
      </button>

      <!-- BOTÃO GRANDE 2: MODO HEADPHONE (ÁUDIO ESPACIAL ESTÉREO) -->
      <button class="btn-giant btn-headphone" id="btnHeadphoneGiant" onclick="toggleHeadphoneGiant()">
        🎧 MODO HEADPHONE: DESATIVADO
      </button>

      <!-- BOTÃO GRANDE 3: ATIVAR/DESATIVAR VOZ AO CLICAR (SÍNTESE DE VOZ) -->
      <button class="btn-giant btn-voice" id="btnVoiceGiant" onclick="toggleClickVoice()">
        🗣️ VOZ AO CLICAR: DESATIVADO
      </button>

      <!-- CONTROLES DE DISTÂNCIA MÁXIMA COM BOTÕES GRANDES (+ / -) (MÍNIMA É FIXA EM 0 CM) -->
      <div style="margin-top: 20px;" class="card-header-title">Ajuste de Distância Máxima (Mínima = 0 cm)</div>

      <!-- Máximo Esquerda -->
      <div class="min-control-box">
        <div class="min-control-label">
          <span>Máximo Esquerdo</span>
          <span id="txtMaxLeft">400 cm</span>
        </div>
        <div class="btn-group-step">
          <button class="btn-step" onclick="adjustMaxDist('left', -25)">-</button>
          <div class="val-display" id="valMaxLeft">400 cm</div>
          <button class="btn-step" onclick="adjustMaxDist('left', +25)">+</button>
        </div>
      </div>

      <!-- Máximo Frente -->
      <div class="min-control-box">
        <div class="min-control-label">
          <span>Máximo Frontal</span>
          <span id="txtMaxFront">400 cm</span>
        </div>
        <div class="btn-group-step">
          <button class="btn-step" onclick="adjustMaxDist('front', -25)">-</button>
          <div class="val-display" id="valMaxFront">400 cm</div>
          <button class="btn-step" onclick="adjustMaxDist('front', +25)">+</button>
        </div>
      </div>

      <!-- Máximo Direita -->
      <div class="min-control-box">
        <div class="min-control-label">
          <span>Máximo Direito</span>
          <span id="txtMaxRight">400 cm</span>
        </div>
        <div class="btn-group-step">
          <button class="btn-step" onclick="adjustMaxDist('right', -25)">-</button>
          <div class="val-display" id="valMaxRight">400 cm</div>
          <button class="btn-step" onclick="adjustMaxDist('right', +25)">+</button>
        </div>
      </div>
    </div>

    <!-- COLUNA 2: VISOR DO ESTUDANTE / EDUCADOR (RADAR ESPACIAL & TELEMETRIA AO VIVO) -->
    <div class="card">
      <div class="card-header-title">
        <span>Visor do Estudante</span>
        <span style="font-size: 0.8rem; font-weight: 600; color: #4ade80;" id="statusBadge">Conectado (56ms)</span>
      </div>

      <div class="canvas-container">
        <canvas id="radarCanvas" width="400" height="400"></canvas>
      </div>

      <div class="student-stats">
        <div class="stat-box left">
          <div class="stat-label">Esquerda</div>
          <div class="stat-val" id="distLeft">--</div>
          <div style="font-size: 0.75rem; color: var(--text-sub);">cm</div>
        </div>
        <div class="stat-box front">
          <div class="stat-label">Frente</div>
          <div class="stat-val" id="distFront">--</div>
          <div style="font-size: 0.75rem; color: var(--text-sub);">cm</div>
        </div>
        <div class="stat-box right">
          <div class="stat-label">Direita</div>
          <div class="stat-val" id="distRight">--</div>
          <div style="font-size: 0.75rem; color: var(--text-sub);">cm</div>
        </div>
      </div>
    </div>

  </div>

  <footer>
    UNIVALI • Engenharia de Computação • Projeto SoundVision
  </footer>

  <script>
    // Bloqueia gestos de zoom por pinça (Pinch-to-zoom) no iOS / Android
    document.addEventListener('gesturestart', function(e) { e.preventDefault(); });
    document.addEventListener('touchmove', function(e) { if (e.scale !== 1) { e.preventDefault(); } }, { passive: false });

    const ws = new WebSocket('ws://' + window.location.hostname + ':81/');
    const canvas = document.getElementById('radarCanvas');
    const ctx = canvas.getContext('2d');

    let currentData = { left: 400, front: 400, right: 400, dmax_l: 400, dmax_f: 400, dmax_r: 400, latency: 56, buzzers: false };
    let obstacleHistory = [];
    const MAX_TRAIL = 15;

    let audioCtx = null;
    let isHeadphoneActive = false;
    let isClickVoiceActive = false;
    let lastBeepTimes = { left: 0, front: 0, right: 0 };

    ws.onmessage = function(event) {
      const data = JSON.parse(event.data);
      currentData = data;

      document.getElementById('distLeft').innerText = data.left > 0 && data.left <= data.dmax_l ? Math.round(data.left) : '--';
      document.getElementById('distFront').innerText = data.front > 0 && data.front <= data.dmax_f ? Math.round(data.front) : '--';
      document.getElementById('distRight').innerText = data.right > 0 && data.right <= data.dmax_r ? Math.round(data.right) : '--';
      document.getElementById('statusBadge').innerText = 'Conectado (' + Math.round(data.latency) + 'ms)';

      // Sincroniza displays de máximo
      document.getElementById('txtMaxLeft').innerText = Math.round(data.dmax_l) + ' cm';
      document.getElementById('valMaxLeft').innerText = Math.round(data.dmax_l) + ' cm';
      
      document.getElementById('txtMaxFront').innerText = Math.round(data.dmax_f) + ' cm';
      document.getElementById('valMaxFront').innerText = Math.round(data.dmax_f) + ' cm';

      document.getElementById('txtMaxRight').innerText = Math.round(data.dmax_r) + ' cm';
      document.getElementById('valMaxRight').innerText = Math.round(data.dmax_r) + ' cm';

      // Sincroniza botão gigante de Buzzers
      const btnBuzzer = document.getElementById('btnBuzzerGiant');
      if (data.buzzers) {
        btnBuzzer.innerText = '🔊 BUZZERS DA PLACA: ATIVADOS';
        btnBuzzer.className = 'btn-giant btn-buzzer-on';
      } else {
        btnBuzzer.innerText = '🔇 BUZZERS DA PLACA: DESATIVADOS';
        btnBuzzer.className = 'btn-giant btn-buzzer-off';
      }

      obstacleHistory.push({ left: data.left, front: data.front, right: data.right });
      if(obstacleHistory.length > MAX_TRAIL) obstacleHistory.shift();

      drawRadar();
      if(isHeadphoneActive) processSpatialAudio();
    };

    function toggleBuzzerGiant() {
      const newState = !currentData.buzzers;
      ws.send(JSON.stringify({ action: 'setBuzzers', enabled: newState }));
      speakText(newState ? 'Buzzers da placa ativados' : 'Buzzers da placa desativados');
    }

    function toggleHeadphoneGiant() {
      if(!audioCtx) audioCtx = new (window.AudioContext || window.webkitAudioContext)();
      isHeadphoneActive = !isHeadphoneActive;
      const btn = document.getElementById('btnHeadphoneGiant');
      if(isHeadphoneActive) {
        btn.innerText = '🎧 MODO HEADPHONE: ATIVADO';
        btn.classList.add('active');
        audioCtx.resume();
        speakText('Modo fone de ouvido ativado');
      } else {
        btn.innerText = '🎧 MODO HEADPHONE: DESATIVADO';
        btn.classList.remove('active');
        speakText('Modo fone de ouvido desativado');
      }
    }

    function toggleClickVoice() {
      isClickVoiceActive = !isClickVoiceActive;
      const btn = document.getElementById('btnVoiceGiant');
      if(isClickVoiceActive) {
        btn.innerText = '🗣️ VOZ AO CLICAR: ATIVADO';
        btn.classList.add('active');
        speakText('Voz ao clicar ativada');
      } else {
        btn.innerText = '🗣️ VOZ AO CLICAR: DESATIVADO';
        btn.classList.remove('active');
        speakText('Voz ao clicar desativada');
      }
    }

    function adjustMaxDist(sensor, step) {
      let l = currentData.dmax_l;
      let f = currentData.dmax_f;
      let r = currentData.dmax_r;

      if(sensor === 'left')  l = Math.max(50, Math.min(400, l + step));
      if(sensor === 'front') f = Math.max(50, Math.min(400, f + step));
      if(sensor === 'right') r = Math.max(50, Math.min(400, r + step));

      ws.send(JSON.stringify({ action: 'setMaxDist', left: l, front: f, right: r }));
      
      const targetVal = sensor === 'left' ? l : (sensor === 'front' ? f : r);
      const nameStr = sensor === 'left' ? 'máximo esquerdo' : (sensor === 'front' ? 'máximo frontal' : 'máximo direito');
      speakText(nameStr + ' ' + targetVal + ' centímetros');
    }

    function speakText(text) {
      if (isClickVoiceActive && 'speechSynthesis' in window) {
        window.speechSynthesis.cancel();
        const utter = new SpeechSynthesisUtterance(text);
        utter.lang = 'pt-BR';
        utter.rate = 1.1;
        window.speechSynthesis.speak(utter);
      }
    }

