theHerick/soundvision/firmware/esp32c3_ultrasonic/esp32c3_ultrasonic.ino
    function drawRadar() {
      const w = canvas.width;
      const h = canvas.height;
      const cx = w / 2;
      const cy = h * 0.85;
      const maxR = h * 0.75;
      const maxGlobal = Math.max(currentData.dmax_l, currentData.dmax_f, currentData.dmax_r);

      ctx.clearRect(0, 0, w, h);

      ctx.strokeStyle = '#334155';
      ctx.lineWidth = 1;
      for(let r = 0.2; r <= 1.0; r += 0.2) {
        ctx.beginPath();
        ctx.arc(cx, cy, maxR * r, Math.PI, 2 * Math.PI);
        ctx.stroke();
        ctx.fillStyle = '#64748b';
        ctx.font = '10px sans-serif';
        ctx.fillText((r * (maxGlobal/100)).toFixed(1) + 'm', cx + 5, cy - maxR * r + 12);
      }

      obstacleHistory.forEach((hist, idx) => {
        const alpha = (idx + 1) / obstacleHistory.length * 0.4;
        drawObstaclePoint(cx, cy, maxR, maxGlobal, -45, hist.left, '#e11d48', alpha);
        drawObstaclePoint(cx, cy, maxR, maxGlobal, 0, hist.front, '#16a34a', alpha);
        drawObstaclePoint(cx, cy, maxR, maxGlobal, 45, hist.right, '#0284c7', alpha);
      });

      drawObstaclePoint(cx, cy, maxR, maxGlobal, -45, currentData.left, '#e11d48', 1.0);
      drawObstaclePoint(cx, cy, maxR, maxGlobal, 0, currentData.front, '#16a34a', 1.0);
      drawObstaclePoint(cx, cy, maxR, maxGlobal, 45, currentData.right, '#0284c7', 1.0);

      ctx.fillStyle = '#3b82f6';
      ctx.beginPath();
      ctx.arc(cx, cy, 8, 0, Math.PI * 2);
      ctx.fill();
      ctx.fillStyle = '#94a3b8';
      ctx.font = '11px sans-serif';
      ctx.textAlign = 'center';
      ctx.fillText('Usuário', cx, cy + 20);
    }

    function drawObstaclePoint(cx, cy, maxR, maxGlobal, deg, dist, color, alpha) {
      if(dist <= 0 || dist > maxGlobal) return;
      const rad = (deg - 90) * Math.PI / 180;
      const r = (dist / maxGlobal) * maxR;
      const x = cx + r * Math.cos(rad);
      const y = cy + r * Math.sin(rad);

      ctx.save();
      ctx.globalAlpha = alpha;
      ctx.fillStyle = color;
      ctx.beginPath();
      ctx.arc(x, y, alpha === 1.0 ? 8 : 4, 0, Math.PI * 2);
      ctx.fill();
      ctx.restore();
    }

    // MODULAÇÃO DOS BIPS SUAVES: T_pulso = Distância (cm) * 10 ms (Frequências Aconchegantes 440Hz, 523Hz, 659Hz)
    function processSpatialAudio() {
      const now = Date.now();
      triggerBeepIfTime(now, 'left', currentData.left, currentData.dmax_l, -1.0, 440);
      triggerBeepIfTime(now, 'front', currentData.front, currentData.dmax_f, 0.0, 523);
      triggerBeepIfTime(now, 'right', currentData.right, currentData.dmax_r, 1.0, 659);
    }

    function triggerBeepIfTime(now, key, dist, dmax, panValue, freq) {
      if(dist <= 0 || dist > dmax) return;
      // T_pulso = distancia * 10 ms
      const T_pulso = Math.max(50.0, dist * 10.0);
      if(now - lastBeepTimes[key] >= T_pulso) {
        playSpatialBeep(panValue, freq);
        lastBeepTimes[key] = now;
      }
    }

    function playSpatialBeep(panValue, freq) {
      if(!audioCtx) return;
      const osc = audioCtx.createOscillator();
      const gain = audioCtx.createGain();
      const panner = audioCtx.createStereoPanner ? audioCtx.createStereoPanner() : null;

      osc.type = 'sine';
      osc.frequency.value = freq;
      gain.gain.setValueAtTime(0.25, audioCtx.currentTime);
      gain.gain.exponentialRampToValueAtTime(0.001, audioCtx.currentTime + 0.04);

      if(panner) {
        panner.pan.value = panValue;
        osc.connect(panner);
        panner.connect(audioCtx.destination);
      } else {
        osc.connect(gain);
        gain.connect(audioCtx.destination);
      }

      osc.start();
      osc.stop(audioCtx.currentTime + 0.04);
    }
  </script>
</body>
</html>
)rawliteral";

// =====================================================================================
// 7. FUNÇÕES AUXILIARES DA FSM E PROCESSAMENTO WEBSOCKET
// =====================================================================================

// Equação (1): Leitura da Distância por Tempo de Voo ultrassônico
float readUltrasonicDistance(uint8_t trigPin, uint8_t echoPin) {
  digitalWrite(trigPin, LOW);
  delayMicroseconds(2);
  digitalWrite(trigPin, HIGH);
  delayMicroseconds(10);
  digitalWrite(trigPin, LOW);

  // Leitura com timeout de 25ms (~400cm max)
  unsigned long duration = pulseIn(echoPin, HIGH, 25000);
  
  if (duration == 0) {
    return 400.0f; // Fora de alcance ou falha de eco
  }

  // d = (v_som * delta_t) / 2
  float distance = (duration * VELOCIDADE_SOM_CM_US) / 2.0f;
  return distance;
}

// CÁLCULO DO INTERVALO DE PULSO SONORO: T_pulso = Distância (cm) * 10 ms (Mínima = 0 cm)
float calculatePulseInterval(float distanceCm, float maxD) {
  if (distanceCm <= 0.0f) return 0.0f;
  if (distanceCm > maxD) return 0.0f; // Sem alerta se fora do alcance máximo

  // T_pulso = Distância * 10 ms
  float t_pulso = distanceCm * 10.0f;
  if (t_pulso < 50.0f) t_pulso = 50.0f; // Intervalo mínimo de segurança (50ms)
  return t_pulso;
}

// Processador de mensagens enviadas pela interface Web
void processIncomingWSMessage(const String& msg) {
  if (msg.indexOf("setMaxDist") >= 0) {
    int lIdx = msg.indexOf("\"left\":");
    int fIdx = msg.indexOf("\"front\":");
    int rIdx = msg.indexOf("\"right\":");
    if (lIdx >= 0) sensors[0].d_max = msg.substring(lIdx + 7).toFloat();
    if (fIdx >= 0) sensors[1].d_max = msg.substring(fIdx + 8).toFloat();
    if (rIdx >= 0) sensors[2].d_max = msg.substring(rIdx + 8).toFloat();
    Serial.printf("[IoT] Máximos configurados: E=%.1f, F=%.1f, D=%.1f cm\n", sensors[0].d_max, sensors[1].d_max, sensors[2].d_max);
  } else if (msg.indexOf("setBuzzers") >= 0) {
    physicalBuzzersEnabled = (msg.indexOf("\"enabled\":true") >= 0);
    Serial.printf("[IoT] Buzzers Físicos (Placa): %s\n", physicalBuzzersEnabled ? "ATIVADOS" : "DESATIVADOS");
  } else if (msg.indexOf("setSensors") >= 0) {
    sensors[0].enabled = (msg.indexOf("\"left\":true") >= 0);
    sensors[1].enabled = (msg.indexOf("\"front\":true") >= 0);
    sensors[2].enabled = (msg.indexOf("\"right\":true") >= 0);
    Serial.printf("[IoT] Toggles Sensores: E=%d, F=%d, D=%d\n", sensors[0].enabled, sensors[1].enabled, sensors[2].enabled);
  }
}

// Loop do Servidor WebSocket Nativo
void handleWebSocketServer() {
  if (wsServer.hasClient()) {
    WiFiClient newClient = wsServer.available();
    bool added = false;
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
      if (!wsClients[i].client || !wsClients[i].client.connected()) {
        wsClients[i].client = newClient;
        wsClients[i].handshaken = false;
        added = true;
        break;
      }
    }
    if (!added) newClient.stop();
  }

