theHerick/soundvision/firmware/esp32c3_ultrasonic/esp32c3_ultrasonic.ino
  for (int i = 0; i < MAX_WS_CLIENTS; i++) {
    if (wsClients[i].client && wsClients[i].client.connected()) {
      if (!wsClients[i].handshaken) {
        String headers = "";
        unsigned long startWait = millis();
        while (wsClients[i].client.connected() && millis() - startWait < 1000) {
          if (wsClients[i].client.available()) {
            String line = wsClients[i].client.readStringUntil('\n');
            headers += line + "\n";
            if (line == "\r" || line == "") break;
          }
        }
        int keyIdx = headers.indexOf("Sec-WebSocket-Key: ");
        if (keyIdx >= 0) {
          int endIdx = headers.indexOf("\r", keyIdx);
          String key = headers.substring(keyIdx + 19, endIdx);
          String acceptKey = computeAcceptKey(key);

          wsClients[i].client.print("HTTP/1.1 101 Switching Protocols\r\n");
          wsClients[i].client.print("Upgrade: websocket\r\n");
          wsClients[i].client.print("Connection: Upgrade\r\n");
          wsClients[i].client.print("Sec-WebSocket-Accept: " + acceptKey + "\r\n\r\n");
          wsClients[i].handshaken = true;
          Serial.println("[WebSocket] Cliente IoT conectado!");
        }
      } else {
        if (wsClients[i].client.available()) {
          String msg = readWSFrame(wsClients[i].client);
          if (msg.length() > 0) {
            processIncomingWSMessage(msg);
          }
        }
      }
    }
  }
}

// Transmissão de Telemetria JSON via WebSocket (~17.8 Hz)
void broadcastTelemetry() {
  String json = "{";
  json += "\"left\":" + String(sensors[0].distance, 1) + ",";
  json += "\"front\":" + String(sensors[1].distance, 1) + ",";
  json += "\"right\":" + String(sensors[2].distance, 1) + ",";
  json += "\"dmax_l\":" + String(sensors[0].d_max, 1) + ",";
  json += "\"dmax_f\":" + String(sensors[1].d_max, 1) + ",";
  json += "\"dmax_r\":" + String(sensors[2].d_max, 1) + ",";
  json += "\"buzzers\":" + String(physicalBuzzersEnabled ? "true" : "false") + ",";
  json += "\"latency\":" + String(currentCycleLatencyMs, 1);
  json += "}";

  for (int i = 0; i < MAX_WS_CLIENTS; i++) {
    if (wsClients[i].client && wsClients[i].client.connected() && wsClients[i].handshaken) {
      sendWSFrame(wsClients[i].client, json);
    }
  }
}

// =====================================================================================
// 8. EXECUÇÃO FSM: INICIALIZAÇÃO & LOOP PRINCIPAL
// =====================================================================================

void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println("\n=======================================================");
  Serial.println("   SOUNDVISION FIRMWARE - ESP32-C3 SYSTEM INITIATED   ");
  Serial.println("=======================================================");

  // ESTADO 1: Inicia Site Web (Wi-Fi Access Point & Servidores)
  currentState = STATE_INIT_WEB;
  Serial.println("[FSM] Estado: Inicia Site Web...");
  
  WiFi.mode(WIFI_AP);
  WiFi.softAP(AP_SSID, AP_PASS);
  IPAddress apIP = WiFi.softAPIP();
  Serial.print("[WiFi] Access Point ativo. SSID: ");
  Serial.println(AP_SSID);
  Serial.print("[WiFi] IP do Servidor Web: ");
  Serial.println(apIP);

  // Rota HTTP principal (Servidor Nativo WebServer)
  server.on("/", []() {
    server.send(200, "text/html", INDEX_HTML);
  });
  server.begin();
  
  // Servidor WebSocket Nativo (Porta 81)
  wsServer.begin();

  // ESTADO 2: Inicia Sensores & Atuadores GPIO
  currentState = STATE_INIT_SENSORS;
  Serial.println("[FSM] Estado: Inicia Sensores e Atuadores PWM...");

  for (int i = 0; i < 3; i++) {
    pinMode(sensors[i].trigPin, OUTPUT);
    pinMode(sensors[i].echoPin, INPUT);
    digitalWrite(sensors[i].trigPin, LOW);

    // Configura atuação de áudio PWM (compatível com ESP32 Core v2.x e v3.x)
    initBuzzer(sensors[i].buzzerPin, sensors[i].ledcChannel, sensors[i].buzzerFreq);
  }

  Serial.println("[FSM] Buzzers Físicos iniciam DESATIVADOS por padrão.");
  Serial.println("[FSM] Inicialização completa. Entrando no ciclo de tempo real...\n");
  currentState = STATE_READ_SENSORS;
}

void loop() {
  cycleStartTime = millis();

  // Mantém os servidores HTTP e WebSockets nativos ativos
  server.handleClient();
  handleWebSocketServer();

  // -----------------------------------------------------------------------------------
  // ESTADO 3: Aquisição de Dados (Leitura Multiplexada Não-Bloqueante)
  // -----------------------------------------------------------------------------------
  if (currentState == STATE_READ_SENSORS) {
    for (int i = 0; i < 3; i++) {
      if (sensors[i].enabled) {
        sensors[i].distance = readUltrasonicDistance(sensors[i].trigPin, sensors[i].echoPin);
      } else {
        sensors[i].distance = 400.0f; // Sensor desativado -> Fora de alcance
      }
      // Multiplexação temporal de ~20ms entre sensores (evita interferência acústica)
      if (i < 2) delay(DELAY_MULTIPLEX_MS);
    }
    currentState = STATE_PROCESS_DATA;
  }

  // -----------------------------------------------------------------------------------
  // ESTADO 4: Processamento (Cálculo T_pulso = distancia * 10 ms por sensor)
  // -----------------------------------------------------------------------------------
  if (currentState == STATE_PROCESS_DATA) {
    for (int i = 0; i < 3; i++) {
      // Validação do intervalo 0 < d <= d_max
      if (sensors[i].distance > 0 && sensors[i].distance <= sensors[i].d_max) {
        sensors[i].pulseInterval = calculatePulseInterval(sensors[i].distance, sensors[i].d_max);
      } else {
        sensors[i].pulseInterval = 0; // Sem alerta auditivo fora da faixa
      }
    }
    currentState = STATE_ACTUATION;
  }

  // -----------------------------------------------------------------------------------
  // ESTADO 5: Atuação Sonora Suave Não-Bloqueante (Bips de 40ms macios e confortáveis)
  // -----------------------------------------------------------------------------------
  if (currentState == STATE_ACTUATION) {
    unsigned long now = millis();

    for (int i = 0; i < 3; i++) {
      if (physicalBuzzersEnabled && sensors[i].pulseInterval > 0 && sensors[i].enabled) {
        
        // 1. Desliga o tom após a duração sutil e curta do bip (40ms)
        if (sensors[i].buzzerState && (now - sensors[i].lastBeepTime >= BEEP_DURATION_MS)) {
          silenceBuzzerPin(sensors[i].buzzerPin, sensors[i].ledcChannel);
          sensors[i].buzzerState = false;
        }

        // 2. Inicia novo bip quando completar o tempo do intervalo (Distância * 10ms)
        if (now - sensors[i].lastBeepTime >= sensors[i].pulseInterval) {
          sensors[i].lastBeepTime = now;
          sensors[i].buzzerState = true;
          setBuzzerTone(sensors[i].buzzerPin, sensors[i].ledcChannel, sensors[i].buzzerFreq);
        }

      } else {
        // Silencia buzzer se desativado ou fora de alcance
        silenceBuzzerPin(sensors[i].buzzerPin, sensors[i].ledcChannel);
        sensors[i].buzzerState = false;
      }
    }

    // Transmissão de telemetria a cada ~50-60 ms via WebSocket
    if (now - lastTelemetryTime >= 50) {
      broadcastTelemetry();
      lastTelemetryTime = now;
    }

    // Retorna para o estado de amostragem
    currentState = STATE_READ_SENSORS;
  }

  // Equação (3): Cálculo da Latência Determinística de Ciclo: T_ciclo ≈ 56 ms
  unsigned long cycleTime = millis() - cycleStartTime;
  currentCycleLatencyMs = (float)cycleTime;
}
